In [1]:
import pandas as pd
import numpy as np

In [27]:
# df=pd.read_excel(r'C:\Users\IN22912959\OneDrive - Tesco\Documents\Supplier Score Card\New folder\User Input Anurag.xlsx')
# aud=pd.read_excel(r'C:\Users\IN22912959\OneDrive - Tesco\Documents\Supplier Score Card\New folder\Audits.xlsx')
comm=pd.read_excel(r'C:\Users\IN22912959\OneDrive - Tesco\Documents\Supplier Score Card\New folder\TFMS Analysis Template Dec 8.xlsx',sheet_name='Commercial Data')

In [3]:
user_input=df.copy()
audits=aud.copy()
commercial=comm.copy()

In [4]:
user_input.head(2)

,Category,Supplier Number,Supplier_Name,Junior_Buyer,Comment,Site 1,Site 2,Site 3,Site 4,Site 5,Site 6,Site 7,Site 8,Site 9,Site 10
0,Household & Pet,12095,ACDOCO LTD,ADDITIVE S.,De-listed,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Household & Pet,14178,BOB MARTIN (UK) LTD,CATLITTE R.,De-listed,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
user_input=user_input.fillna('Blank')
user_input.head(20)
user_input.shape

(587, 15)

In [10]:
df2=pd.melt(user_input, id_vars=['Junior_Buyer','Supplier Number','Supplier_Name'], value_vars=['Comment']+['Site '+str(x) for x in range(1,11)])

In [11]:
df2.head(2)

       Junior_Buyer Supplier Number        Supplier_Name variable      value
0  ADDITIVE      S.           12095           ACDOCO LTD  Comment  De-listed
1  CATLITTE      R.           14178  BOB MARTIN (UK) LTD  Comment  De-listed

In [12]:
df3=df2[df2['variable']!="Comments"]
df4=df3[df3['value']!="Blank"]
df4.variable.unique()

array(['Comment', 'Site 1', 'Site 2', 'Site 3', 'Site 4', 'Site 5',
       'Site 6', 'Site 7', 'Site 8', 'Site 9', 'Site 10'], dtype=object)

In [13]:
# df4.to_excel('Nisar.xlsx')
df4.head(5)

,Junior_Buyer,Supplier Number,Supplier_Name,variable,value
0,ADDITIVE S.,12095,ACDOCO LTD,Comment,De-listed
1,CATLITTE R.,14178,BOB MARTIN (UK) LTD,Comment,De-listed
2,DETERGENT S.,46617,PERSAN SA,Comment,De-listed
3,TOILET PAPE R.,53045,ESSITY UK LIMITED,Comment,De-listed
4,HOME ESSENTIALS.,54178,BORD NA MONA FUELS LTD,Comment,Not HHP Supplier

In [14]:
df4[df4['Supplier_Name']=='SHS (GB) GROCERY FOOD']

,Junior_Buyer,Supplier Number,Supplier_Name,variable,value
78,DESSERT1 S.,34645,SHS (GB) GROCERY FOOD,Comment,"Condensed milk, evap milk & light milk, Rice p..."
79,HOMEBAK E.,34645,SHS (GB) GROCERY FOOD,Comment,Brand or delisted cake batter mixes
665,DESSERT1 S.,34645,SHS (GB) GROCERY FOOD,Site 1,213582 - Bolswald condensed milk
1252,DESSERT1 S.,34645,SHS (GB) GROCERY FOOD,Site 2,4155- Hochwald evaporated milks
1839,DESSERT1 S.,34645,SHS (GB) GROCERY FOOD,Site 3,103014- Limelco canned rice puddings

In [97]:
# df4['value']=str(df4['value'])

In [15]:
df4.dtypes

Junior_Buyer       object
Supplier Number    object
Supplier_Name      object
variable           object
value              object
dtype: object

In [16]:
cols=['Site_Code','Site_Name','Supplier_Code','Supplier_Name']
aud_sites=aud[['Site Code','Site Name','Supplier Code','Supplier Name']].drop_duplicates()
aud_sites.columns=cols
aud_sites.head(2)

  Site_Code                Site_Name Supplier_Code              Supplier_Name
0   5010692  HB Gold Standard Site 1         A6900  HB Gold Standard Supplier
2       ON5          Costa de Huelva         67880                 Onubafruit

In [100]:
# sites=tqc_sites[['Site_Code','Site_Name','Supplier_Code','Supplier_Name','Junior_Buyer']].drop_duplicates()

In [101]:
# sites.to_excel('sites.xlsx')

In [102]:
# sites.dtypes

In [103]:
# df4.to_excel('Nisar.xlsx')

In [17]:
df5=df4
f = lambda x: str(x["value"]).partition("-")[0].strip()
df5["Site_Codes"] = df5.apply(f,axis=1)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [18]:
df5.to_excel('Nisar_2.xlsx')
df5[df5['Site_Codes']=='213582']

,Junior_Buyer,Supplier Number,Supplier_Name,variable,value,Site_Codes
665,DESSERT1 S.,34645,SHS (GB) GROCERY FOOD,Site 1,213582 - Bolswald condensed milk,213582

In [21]:
# sites=pd.read_excel(r'C:\Users\IN22912959\sites.xlsx')
feedback_sites=pd.read_excel(r'C:\Users\IN22912959\Nisar_2.xlsx')
feedback_sites[feedback_sites['variable']!='Comment'].head(2)

,Junior_Buyer,Supplier Number,Supplier_Name,variable,value,Site_Codes
305,DISHWASHIN G.,69133,SUAVIZANTES Y PLASTIFICANTES B,Site 1,A8102-001,A8102-001
306,CATLITTE R.,69155,MACROMIN LTD,Site 1,A8187-002,A8187-002

In [22]:
# df6=feedback_sites[['Supplier Number','Supplier_Name','Junior_Buyer','Site_Codes']].merge(sites,how='left',right_on=['Site_Code','Junior_Buyer'],left_on=['Site_Codes','Junior_Buyer'])
# df6.head(2)
comm.head(2)

,Parent_Supplier,Parent_Supplier_name,Supplier_Number,Supplier_Name,Commercial_Director,Commercial_Area,Category_Director,Category_Area,Buying_Controller,Buyer_Area,Buyer,Junior_Buyer,Junior_Area,Product_Area,Status,COGS_TY,OBL_Count,BL_Count
0,4723,OTL,65450,OTL,PACKAGE D.,Packaged,HB&WELLNES S.,"Health, Beauty & Wellness",TOILETRIE S.,Bathing & Washing,BATHING&WASHING.,WASHIN G.,Washing,Toiletries,Yes,19638.919,0,216
1,6404,GOLDEN ACRE DAIRY FOODS LTD,63057,GOLDEN ACRE FOODS LTD,PACKAGE D.,Packaged,GROCER Y.,Grocery,INGREDS&GLOBA L.,"European, USA, Caribbean & Kos",EUR USA CAR K O.,KOSHE R.,Kosher,Ingredients & Global Grocery,Yes,76057.291,0,3617

In [23]:
com_match=comm.merge(feedback_sites,how='left', left_on=['Supplier_Number','Junior_Buyer'],right_on=['Supplier Number','Junior_Buyer'])

In [33]:
com_match=com_match[com_match['Site_Codes'].notnull()]
com_match_with_Supplier_Code=com_match.merge(aud_sites,how='left',left_on=['Site_Codes'],right_on=['Site_Code'])
# com_match_with_Supplier_Code.to_excel('df2.xlsx')
com_match_with_Supplier_Code.head(2)

,Parent_Supplier,Parent_Supplier_name,Supplier_Number,Supplier_Name_x,Commercial_Director,Commercial_Area,Category_Director,Category_Area,Buying_Controller,Buyer_Area,...,BL_Count,Supplier Number,Supplier_Name_y,variable,value,Site_Codes,Site_Code,Site_Name,Supplier_Code,Supplier_Name
0,10505,ADDO FOOD GROUP,11575,PORK FARMS LIMITED(VF,FRES H.,Fresh,PREPARED FOOD S.,Prepared Foods,CHILLE D.,"Pies, Savouries & Snacking",...,0,11575,PORK FARMS LIMITED(VF,Comment,Now owned by Kerry Foods,Now owned by Kerry Foods,NaN,NaN,NaN,NaN
1,10505,ADDO FOOD GROUP,11575,PORK FARMS LIMITED(VF,FRES H.,Fresh,PREPARED FOOD S.,Prepared Foods,CHILLE D.,"Pies, Savouries & Snacking",...,0,11575,PORK FARMS LIMITED(VF,Site 1,2409 - Pork Farms,2409,2409,Pork Farms Caspian - Poole,29244,Kerry Foods Ltd

In [111]:
# tqc.columns
# cols=['Supplier_Code','Supplier_Name','Site_Code','Site_Name','Junior_Buyer','Comm_Supplier_Name','Supplier_Number']
# tqc_data=tqc[cols].drop_duplicates()
# tqc_not_matched=tqc_data[tqc_data['Supplier_Number'].isnull()]
# tqc_not_matched.to_excel('tqc_not_matched.xlsx')
# # tqc_not_matched[tqc_not_matched['Supplier_Name']=='FARMLEA FOODS']

NameError: name 'tqc' is not defined

In [37]:
comm.columns
cols=['Supplier_Number','Supplier_Name','Junior_Buyer','Supplier Code from TQC']
comm_data=comm[cols]
comm_not_matched=comm_data[comm_data['Supplier Code from TQC'].isnull()]
comm_not_matched.head(2)

,Supplier_Number,Supplier_Name,Junior_Buyer,Supplier Code from TQC
0,65450,OTL,WASHIN G.,NaN
1,63057,GOLDEN ACRE FOODS LTD,KOSHE R.,NaN

In [38]:
comm_matched=comm_not_matched.merge(com_match_with_Supplier_Code,how='left',left_on=['Supplier_Number','Junior_Buyer'],right_on=['Supplier Number','Junior_Buyer'])
comm_matched_2=comm_matched[(comm_matched['Supplier Number'].notnull())&(comm_matched['Site_Code'].notnull())]

In [297]:
tqc_match=tqc_not_matched.merge(df6,how='left',left_on=['Supplier_Number','Junior_Buyer'],right_on=['Supplier Number','Junior_Buyer'])
# comm_matched_2=comm_matched[(comm_matched['Supplier Number'].notnull())&(comm_matched['Site_Code'].notnull())]

In [300]:
tqc_match.to_excel('Nisar_4.xlsx')

In [39]:
comm_matched_2.to_excel('Nisar_6.xlsx')